// Получить строковое название дня недели по номеру дня.

// function week() {
//     let a = prompt('Введите номер дня', ''); 
//     if (a == 1) {
//           alert('Это понедельник!')
//         } else if (a == 2) {
//             alert('Это вторник')
//         } else if ( a == 3){
//             alert ('Это среда')
//         } else if ( a == 4){
//             alert ('Это четверг')
//         } else if ( a == 5){
//             alert ('Это пятница')
//         } else if ( a == 6){
//             alert ('Это суббота')
//         } else if (a == 7){
//             alert ('')
//         } else if ( a > 7) {
//             alert ('Введите правильное число')
//         }
//     }
    

// week()

// Вводим число (0-999), получаем строку с прописью числа

  //  function go() {
  //     let n = prompt ('Введите число от 0 до 999', '')

  //     let hundreds = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"];
  //     let tens = ["", "надцать", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"];
  //     let ones = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"];
  //     let h = t = o = "";

  //     if(n >= 100) h = hundreds[n[n.length-3]] + " ";
	//  		else s = "";

	//  		if(n >= 10) t = tens[n[n.length-2]] + " ";
	//  		else d = "";

  //     o = ones[n[n.length-1]];

  //     if(n >= 11 && n <= 19){ 
  //     alert (`Это число : ${h}${o}${t}`)
  //    } else alert (`Это число: ${h}${t}${o}`);
  //  }
  //  go()

  
  // Вводим число (0-999), получаем строку с прописью числа

    // function go() {
    //    let n = prompt ('Введите число прописью от 0 до 999', '')

    //    let hundreds = ["", "100", "200", "300", "400", "500", "600", "700", "800", "900"];
    //    let tens = ["", "надцать", "20", "30", "40", "50", "60", "70", "80", "90"];
    //    let ones = ["", "1", "2", "3", "4", "5", "6", "7", "8", "9"];
    //    let h = t = o = "";

    //    if(n >= 100) h = hundreds[n[n.length-3]] + " ";
	  // 		else s = "";

	  // 		if(n >= 10) t = tens[n[n.length-2]] + " ";
	  // 		else d = "";

    //    o = ones[n[n.length-1]];

    //    if(n >= 11 && n <= 19){ 
    //    alert (`Это число : ${h}${o}${t}`)
    //   } else alert (`Это число: ${h}${t}${o}`);
    // }
    // go()

   let number = random.nextInt(1000);

        if (number < 10) {
            to10(number);
        } else if (number < 20) {
            to20(number);
        } else if (number < 100) {
            to100(number / 10);
            to10(number % 10);
        } else if (number < 1000) {
            to1000(number / 100);
            to100((number % 100) / 10);
            to10(number % 10);
        }
   
        console.log(number)

      //   function Dictionary (){ 
      //   let Number = new Dictionary(string, let)(); {
      //       [  "ноль", 0 ], [ "один", 1 ], [ "два", 2 ], [  "три", 3 ], [ "четыре", 4 ], [  "пять", 5 ],  ["шесть", 6 ], [  "семь", 7 ],  ["восемь", 8 ], [  "девять", 9 ], [  "десять", 10 ],
      //       [  "одиннадцать", 11 ], [ "двенадцать", 12 ], ["тринадцать", 13 ], ["четырнадцать", 14 ], ["пятнадцать", 15 ], ["шестнадцать", 16 ], ["семьнадцать", 17 ], ["восемьнадцать", 18 ], ["девятнадцать", 19 ],
      //       [  "двадцать", 20 ], ["тридцать", 30 ], ["сорок", 40 ], ["пятьдесят", 50 ], ["шестьдесят", 60 ], ["семьдесят", 70 ], ["восемьдесят", 80 ], ["девяносто", 90 ],
      //       [  "сто", 100 ], ["двести", 200 ], ["триста", 300 ], ["четыреста", 400 ], ["пятьсот", 500 ], ["шестьсот", 600 ], ["семьсот", 700 ], ["восемьсот", 800 ], ["девятьсот", 900 ]
      //   };
     
      //   Number ( string ) => s.Split().Sum (x => Numbers[x]);
      //   {
      //       console.log(Number)
      //   }
      // }
      //   Dictionary()



  // function distance(){
  //   let x = 1;
  //   let x1 = 2;
  //   let y = 2;
  //   let y1 = 2;
    
  //   let distance = (x,y, x1, y1) => Math.hypot(x1-x, y1 -y);
  //   console.log(distance)
  // }

  // distance()
// function distance(){ 
//           let x1 = 51;
//           let y1 = 5;
//           let x2 = 2;
//           let y2 = 7;
//           let x3;
//           let y3;

//           if (x1 < x2) {
//             x3 = x1;
//             y3 = y2;
//             distance = Math.sqrt(Math.pow(Math.abs(x3 - x2), 2) + Math.pow(Math.abs(y3 - y1), 2));
//           } else {
//             x3 = x2;
//             y3 = y1;
//             distance = Math.sqrt(Math.pow(Math.abs(x3 - x1), 2) + Math.pow(Math.abs(y3 - y2), 2));
//           }

//           console.log("Расстояние между двумя точками: " + distance);
//         }
//         distance();